#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-jddqz6tbkRbVqWqP

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.frontend_preprod.digitalocean_record.subdomain: Refreshing state... [id=135753207]
module.infrastructure.module.frontend_preprod_fluent_labs.digitalocean_record.subdomain: Refreshing state... [id=137228821]
module.infrastructure.module.frontend_fluent_labs.digitalocean_record.subdomain: Refreshing state... [id=137228820]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.module.database.digitalocean_database_cluster.api_db: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E24WKSQ64NM98U]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/preprod.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend_preprod.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/preprod.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3K4UXB7EV5E2G]
module.infrastructure.module.frontend_preprod.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3F8QDRJGU7DO0]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.frontend_preprod.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIAQRKEJGTPK4BHXIN6]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::037187302622:policy/elasticsearch-backup-role]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/0423bb0e8dbb3575cf844a838c619b5a03db]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/0473fc3cddaf1461c78ebf15ce5d034dc808]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:037187302622:certificate/b09e66b0-9068-4392-9676-d99e98aade66]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.api.digitalocean_database_user.api_user: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/user/api-default]
module.infrastructure.module.api.digitalocean_database_db.api_database: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/database/foreign-language-reader-default]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65-20210110103039465500000001]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns: Refreshing state... [id=138795790]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=138795789]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=138795791]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.acme_certificate.certificate will be updated in-place
  ~ resource "acme_certificate" "certificate" {
      ~ certificate_domain           = "*.foreignlanguagereader.com" -> (known after apply)
      ~ certificate_p12              = (sensitive value)
      ~ certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFPTCCBCWgAwIBAgISBHP8PN2vFGHHjr8Vzl0DTcgIMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMTAyMjUwNDI1MDNaFw0yMTA1MjYwNDI1MDNaMCYxJDAiBgNVBAMM
            GyouZm9yZWlnbmxhbmd1YWdlcmVhZGVyLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOJeP5miwkqKVFZTEL75JU+4qc/KECQ3+HdNTCD16DnOQi1n
            qdC/8CJmpD/3OY+dDbzgjPeYDUAHb9YLXaOc0Rewo7gFRygks5CTSUbgy5cLseCw
            NSLckVB3rrt2q9V+cBQHUyltIm/6LC2xXLFDi5KVPx++N0qhvPbPefG5nWq/VpWC
            hq5c6kpI80Wez0EL+9pBODwtU1wHx21q3Ys2KtLo/5ihUR9aRMaTUlRxiv6igleH
            bFVSbX9RYDNIMpiNMFUMkMFEkH55T6aIPZGhILRS/no4oToXRjJlr9b686yws/dS
            n2iHCT37eRFesz9u3kD9ZRUdE1Gzn4oYGlqZkycCAwEAAaOCAlcwggJTMA4GA1Ud
            DwEB/wQEAwIFoDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0T
            AQH/BAIwADAdBgNVHQ4EFgQUlaRsI3FHN3cg5QGlKwgF2thizlswHwYDVR0jBBgw
            FoAUFC6zF7dYVsuuUAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUF
            BzABhhVodHRwOi8vcjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9y
            My5pLmxlbmNyLm9yZy8wJgYDVR0RBB8wHYIbKi5mb3JlaWdubGFuZ3VhZ2VyZWFk
            ZXIuY29tMEwGA1UdIARFMEMwCAYGZ4EMAQIBMDcGCysGAQQBgt8TAQEBMCgwJgYI
            KwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0c2VuY3J5cHQub3JnMIIBBQYKKwYBBAHW
            eQIEAgSB9gSB8wDxAHcARJRlLrDuzq/EQAfYqP4owNrmgr7YyzG1P9MzlrW2gagA
            AAF316XPuQAABAMASDBGAiEA5snDxJhCndqk7fug68ozLtPZvQxitXwLhkSLijJp
            rGYCIQD4ZvtTKmle5UC4ZuqRE95QjvOs2D4jkTugCRYjOXcSfQB2AH0+8viP/4hV
            aCTCwMqeUol5K8UOeAl/LmqXaJl+IvDXAAABd9elz+UAAAQDAEcwRQIhAL1bj+aI
            tURHqEjMt2065Ws1jIY4i109riJ2CxfUge2mAiBYfgketZrzsUN7g1S+po/j3PTk
            wlCHxfKPDG6aiPqFpzANBgkqhkiG9w0BAQsFAAOCAQEAjz+V0v6svA1ufL0SYODk
            407DwjJ+77V/eYG2RT20FlNsy+bjQ/JXoNSppP3Z4bImUKCgoXljsucaGgqfS2k9
            vQmXVbn7go93hoKtGZ7trN319vw747PJ86bsAxLEwl77aqQrvUk7dpp5GPnyKOCF
            KAnvZw0r1DhkbAqdBfWxEEz8ib1S4BEoLW49YhPo6WSqfeBtf5laSEYCqJr3NXkl
            A0fiAuKt3bIZ6TDsL4RI1Ucz7zi+osSEmvBrxm0nxaLUbgTSaysLBDBxAKetAPw6
            TAy9bXJppFAjAETGrYA3odfaN+ZJW4J+S9dHSOLsglQVQTzuGZ1y45gvZs6CAZBC
            7g==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/0473fc3cddaf1461c78ebf15ce5d034dc808" -> (known after apply)
        id                           = "https://acme-v02.api.letsencrypt.org/acme/cert/0473fc3cddaf1461c78ebf15ce5d034dc808"
      ~ issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEZTCCA02gAwIBAgIQQAF1BIMUpMghjISpDBbN3zANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIwMTAwNzE5MjE0MFoXDTIxMDkyOTE5MjE0MFow
            MjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxCzAJBgNVBAMT
            AlIzMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuwIVKMz2oJTTDxLs
            jVWSw/iC8ZmmekKIp10mqrUrucVMsa+Oa/l1yKPXD0eUFFU1V4yeqKI5GfWCPEKp
            Tm71O8Mu243AsFzzWTjn7c9p8FoLG77AlCQlh/o3cbMT5xys4Zvv2+Q7RVJFlqnB
            U840yFLuta7tj95gcOKlVKu2bQ6XpUA0ayvTvGbrZjR8+muLj1cpmfgwF126cm/7
            gcWt0oZYPRfH5wm78Sv3htzB2nFd1EbjzK0lwYi8YGd1ZrPxGPeiXOZT/zqItkel
            /xMY6pgJdz+dU/nPAeX1pnAXFK9jpP+Zs5Od3FOnBv5IhR2haa4ldbsTzFID9e1R
            oYvbFQIDAQABo4IBaDCCAWQwEgYDVR0TAQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8E
            BAMCAYYwSwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5p
            ZGVudHJ1c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTE
            p7Gkeyxx+tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEE
            AYLfEwEBATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2Vu
            Y3J5cHQub3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0
            LmNvbS9EU1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYf
            r52LFMLGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjANBgkqhkiG9w0B
            AQsFAAOCAQEA2UzgyfWEiDcx27sT4rP8i2tiEmxYt0l+PAK3qB8oYevO4C5z70kH
            ejWEHx2taPDY/laBL21/WKZuNTYQHHPD5b1tXgHXbnL7KqC401dk5VvCadTQsvd8
            S8MXjohyc9z9/G2948kLjmE6Flh9dDYrVYA9x2O+hEPGOaEOa1eePynBgPayvUfL
            qjBstzLhWVQLGAkXXmNs+5ZnPBxzDJOLxhF2JIbeQAcH5H0tZrUlo5ZYyOqA7s9p
            O5b85o3AM/OJ+CktFBQtfvBhcJVd9wvlwPsk+uyOy2HI7mNxKKgsBTt375teA2Tw
            UdHkhVNcsAKX1H7GNNLOEADksd86wuoXvg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ private_key_pem              = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.acme_certificate.certificate_fluent_labs will be updated in-place
  ~ resource "acme_certificate" "certificate_fluent_labs" {
      ~ certificate_domain           = "*.fluentlabs.io" -> (known after apply)
      ~ certificate_p12              = (sensitive value)
      ~ certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFJDCCBAygAwIBAgISBCO7Do27NXXPhEqDjGGbWgPbMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMTAyMjUwNDQ0MzNaFw0yMTA1MjYwNDQ0MzNaMBoxGDAWBgNVBAMM
            DyouZmx1ZW50bGFicy5pbzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEB
            AKtV6ikd5Nf4zcqXntiUzmK3KAA7U/pQ+WpNgcb+ifzEjTKzodJqgtJxzKwMqRiA
            mIB1dFKEdM3LL8sJV6JFyLnZSl/i7gZ98vujDSp8YueBm6wphjps5xBRDRYArFMO
            DC9E9XZWa61fDdFSjEbtUhYhUs5sqmdzEoPty7lhEgaDm8bCDcth6VsgJiq65JbY
            bldKW+LmkCPrHHRMF+Ob/U1hHYyLAtJj1w329uyhRvE6aSeI+utqejOlwqAhdkY4
            84auqc5Ii+TsEmudb8/GBMMwNDPGTYrBgo1IVDth1bj+eELiNQT74yt5Dj9cEnvl
            u/bSr4R1Gwh5up8d26xjewkCAwEAAaOCAkowggJGMA4GA1UdDwEB/wQEAwIFoDAd
            BgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAdBgNV
            HQ4EFgQUdbcIvWxRYNKNwG72RunUK7jac9QwHwYDVR0jBBgwFoAUFC6zF7dYVsuu
            UAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUFBzABhhVodHRwOi8v
            cjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9yMy5pLmxlbmNyLm9y
            Zy8wGgYDVR0RBBMwEYIPKi5mbHVlbnRsYWJzLmlvMEwGA1UdIARFMEMwCAYGZ4EM
            AQIBMDcGCysGAQQBgt8TAQEBMCgwJgYIKwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0
            c2VuY3J5cHQub3JnMIIBBAYKKwYBBAHWeQIEAgSB9QSB8gDwAHYAXNxDkv7mq0VE
            sV6a1FbmEDf71fpH3KFzlLJe5vbHDsoAAAF317enxwAABAMARzBFAiBv5/9SRAAw
            HVzp2Z6hR4Di7ZfAv68rwQ3mDIDBEopiegIhAN77hP9C9JyfL9MDUdBcc3LH/7bR
            KZyzPBH4TaChTo+dAHYA9lyUL9F3MCIUVBgIMJRWjuNNExkzv98MLyALzE7xZOMA
            AAF317ensgAABAMARzBFAiEAl1r7NIfRXj/Q6E9FBiXSTso0GWvyL8gJyIp7TOg6
            bqgCIErBjbb+hF8UtvOg4heovLhjNugPzljTXRGCNWjRSFMfMA0GCSqGSIb3DQEB
            CwUAA4IBAQBhew1SK9FWWAHfDQ5RtGR02E6hR31XvlC4NLqPYTDLIZ2iSpAEUBIn
            gwWe4/TKA4S5m29V6xh5MrTc2osoLe88wG/VGXf5EVNV8SDNPhMnu0qUvZW16WtG
            qsRe4mIfmM9hHAggt/9f+aJytY+NsK1bm9NY5B5Rdpxzpgqt4QG/lP/Va+lFMxe4
            EIBm3PBMlXC+QSfkwwukRE7qrQlSUKPynu+sqZz6Jlc2rMiUhXG+GdR+4T2PsouB
            xWMV5UUhjsPy5e6CO0qDsN7nfk08DRl7HPCpvgVbb9znSO/SDn8ejClbe+MeHRa1
            F1NjgVhrSPiz1LdSbNKn3Pq35u9K9Pzd
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/0423bb0e8dbb3575cf844a838c619b5a03db" -> (known after apply)
        id                           = "https://acme-v02.api.letsencrypt.org/acme/cert/0423bb0e8dbb3575cf844a838c619b5a03db"
      ~ issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEZTCCA02gAwIBAgIQQAF1BIMUpMghjISpDBbN3zANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIwMTAwNzE5MjE0MFoXDTIxMDkyOTE5MjE0MFow
            MjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxCzAJBgNVBAMT
            AlIzMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuwIVKMz2oJTTDxLs
            jVWSw/iC8ZmmekKIp10mqrUrucVMsa+Oa/l1yKPXD0eUFFU1V4yeqKI5GfWCPEKp
            Tm71O8Mu243AsFzzWTjn7c9p8FoLG77AlCQlh/o3cbMT5xys4Zvv2+Q7RVJFlqnB
            U840yFLuta7tj95gcOKlVKu2bQ6XpUA0ayvTvGbrZjR8+muLj1cpmfgwF126cm/7
            gcWt0oZYPRfH5wm78Sv3htzB2nFd1EbjzK0lwYi8YGd1ZrPxGPeiXOZT/zqItkel
            /xMY6pgJdz+dU/nPAeX1pnAXFK9jpP+Zs5Od3FOnBv5IhR2haa4ldbsTzFID9e1R
            oYvbFQIDAQABo4IBaDCCAWQwEgYDVR0TAQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8E
            BAMCAYYwSwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5p
            ZGVudHJ1c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTE
            p7Gkeyxx+tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEE
            AYLfEwEBATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2Vu
            Y3J5cHQub3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0
            LmNvbS9EU1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYf
            r52LFMLGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjANBgkqhkiG9w0B
            AQsFAAOCAQEA2UzgyfWEiDcx27sT4rP8i2tiEmxYt0l+PAK3qB8oYevO4C5z70kH
            ejWEHx2taPDY/laBL21/WKZuNTYQHHPD5b1tXgHXbnL7KqC401dk5VvCadTQsvd8
            S8MXjohyc9z9/G2948kLjmE6Flh9dDYrVYA9x2O+hEPGOaEOa1eePynBgPayvUfL
            qjBstzLhWVQLGAkXXmNs+5ZnPBxzDJOLxhF2JIbeQAcH5H0tZrUlo5ZYyOqA7s9p
            O5b85o3AM/OJ+CktFBQtfvBhcJVd9wvlwPsk+uyOy2HI7mNxKKgsBTt375teA2Tw
            UdHkhVNcsAKX1H7GNNLOEADksd86wuoXvg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ private_key_pem              = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + certificate_chain         = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.infrastructure.aws_iam_access_key.github will be created
  + resource "aws_iam_access_key" "github" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "foreign-language-reader-github"
    }

  # module.infrastructure.aws_iam_user.github will be created
  + resource "aws_iam_user" "github" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "foreign-language-reader-github"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.infrastructure.module.content.data.aws_iam_policy_document.spark_deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "spark_deploy"  {
      ~ id      = "1335476165" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:ListMultipartUploadParts",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::foreign-language-reader-content/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::foreign-language-reader-content/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.content.data.aws_iam_policy_document.spark_read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "spark_read"  {
      ~ id      = "111904793" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::foreign-language-reader-content/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::foreign-language-reader-content/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.content.data.aws_iam_policy_document.spark_write will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "spark_write"  {
      ~ id      = "2827403128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::foreign-language-reader-content/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::foreign-language-reader-content/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.content.aws_iam_access_key.github will be created
  + resource "aws_iam_access_key" "github" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "github-spark-deploy"
    }

  # module.infrastructure.module.content.aws_iam_access_key.spark will be created
  + resource "aws_iam_access_key" "spark" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "spark"
    }

  # module.infrastructure.module.content.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to spark"
      + id          = (known after apply)
      + name        = "spark-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.content.aws_iam_policy.spark_read will be created
  + resource "aws_iam_policy" "spark_read" {
      + arn         = (known after apply)
      + description = "IAM policy to let spark read from content uploaded to S3"
      + id          = (known after apply)
      + name        = "spark-read-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.content.aws_iam_policy.spark_write will be created
  + resource "aws_iam_policy" "spark_write" {
      + arn         = (known after apply)
      + description = "IAM policy to let spark write results from content uploaded to S3"
      + id          = (known after apply)
      + name        = "spark-write-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.content.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "spark-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "github-spark-deploy",
        ]
    }

  # module.infrastructure.module.content.aws_iam_policy_attachment.spark_read will be created
  + resource "aws_iam_policy_attachment" "spark_read" {
      + id         = (known after apply)
      + name       = "spark-read-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "spark",
        ]
    }

  # module.infrastructure.module.content.aws_iam_policy_attachment.spark_write will be created
  + resource "aws_iam_policy_attachment" "spark_write" {
      + id         = (known after apply)
      + name       = "spark-write-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "spark",
        ]
    }

  # module.infrastructure.module.content.aws_iam_user.github will be created
  + resource "aws_iam_user" "github" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github-spark-deploy"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.infrastructure.module.content.aws_iam_user.spark will be created
  + resource "aws_iam_user" "spark" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "spark"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.infrastructure.module.content.aws_s3_bucket.content will be created
  + resource "aws_s3_bucket" "content" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "fluentlabs-content"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.infrastructure.module.content.kubernetes_secret.spark_config will be updated in-place
  ~ resource "kubernetes_secret" "spark_config" {
      ~ data = (sensitive value)
        id   = "default/spark-config"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.elasticsearch.data.aws_iam_policy_document.elasticsearch_backup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elasticsearch_backup"  {
      ~ id      = "234279223" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucketVersions",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::foreign-language-reader-elasticsearch-backups"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListMultipartUploadParts",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::foreign-language-reader-elasticsearch-backups/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::foreign-language-reader-elasticsearch-backups",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::foreign-language-reader-elasticsearch-backups/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch will be created
  + resource "aws_iam_access_key" "elasticsearch" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "elasticsearch"
    }

  # module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup will be created
  + resource "aws_iam_policy" "elasticsearch_backup" {
      + arn         = (known after apply)
      + description = "IAM policy to let elasticsearch backup documents to S3"
      + id          = (known after apply)
      + name        = "elasticsearch-backup-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup will be created
  + resource "aws_iam_policy_attachment" "elasticsearch_backup" {
      + id         = (known after apply)
      + name       = "elasticsearch-backup-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "elasticsearch",
        ]
    }

  # module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch will be created
  + resource "aws_iam_user" "elasticsearch" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "elasticsearch"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.infrastructure.module.elasticsearch.aws_s3_bucket.backup will be created
  + resource "aws_s3_bucket" "backup" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "fluentlabs-elasticsearch-backups"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups will be updated in-place
  ~ resource "elasticsearch_snapshot_repository" "backups" {
        id       = "S3-backup"
        name     = "S3-backup"
      ~ settings = {
          - "bucket" = "foreign-language-reader-elasticsearch-backups"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials will be updated in-place
  ~ resource "kubernetes_secret" "elasticsearch_aws_credentials" {
      ~ data = (sensitive value)
        id   = "default/elasticsearch-s3-creds"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.frontend.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "www.foreignlanguagereader.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access must be replaced
-/+ resource "aws_s3_bucket_policy" "public_access" {
      ~ bucket = "www.foreignlanguagereader.com" -> (known after apply) # forces replacement
      ~ id     = "www.foreignlanguagereader.com" -> (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend.digitalocean_record.subdomain will be destroyed
  - resource "digitalocean_record" "subdomain" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "www.foreignlanguagereader.com" -> null
      - id       = "127348003" -> null
      - name     = "www" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "CNAME" -> null
      - value    = "d37vzwjuvb9dg1.cloudfront.net." -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "www.fluentlabs.io"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access must be replaced
-/+ resource "aws_s3_bucket_policy" "public_access" {
      ~ bucket = "www.fluentlabs.io" -> (known after apply) # forces replacement
      ~ id     = "www.fluentlabs.io" -> (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend_fluent_labs.digitalocean_record.subdomain will be destroyed
  - resource "digitalocean_record" "subdomain" {
      - domain   = "fluentlabs.io" -> null
      - flags    = 0 -> null
      - fqdn     = "www.fluentlabs.io" -> null
      - id       = "137228820" -> null
      - name     = "www" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "CNAME" -> null
      - value    = "d2dtw2gn3bipxh.cloudfront.net." -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.frontend_preprod.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "preprod.foreignlanguagereader.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access must be replaced
-/+ resource "aws_s3_bucket_policy" "public_access" {
      ~ bucket = "preprod.foreignlanguagereader.com" -> (known after apply) # forces replacement
      ~ id     = "preprod.foreignlanguagereader.com" -> (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod.digitalocean_record.subdomain will be destroyed
  - resource "digitalocean_record" "subdomain" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "preprod.foreignlanguagereader.com" -> null
      - id       = "135753207" -> null
      - name     = "preprod" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "CNAME" -> null
      - value    = "d3sy7q5jxvbakd.cloudfront.net." -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "preprod.fluentlabs.io"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access must be replaced
-/+ resource "aws_s3_bucket_policy" "public_access" {
      ~ bucket = "preprod.fluentlabs.io" -> (known after apply) # forces replacement
      ~ id     = "preprod.fluentlabs.io" -> (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.digitalocean_record.subdomain will be destroyed
  - resource "digitalocean_record" "subdomain" {
      - domain   = "fluentlabs.io" -> null
      - flags    = 0 -> null
      - fqdn     = "preprod.fluentlabs.io" -> null
      - id       = "137228821" -> null
      - name     = "preprod" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "CNAME" -> null
      - value    = "d1kd5as75rg2vt.cloudfront.net." -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be updated in-place
  ~ resource "kubernetes_secret" "nginx_certificate" {
      ~ data = (sensitive value)
        id   = "default/nginx-certificate"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 27 to add, 7 to change, 8 to destroy.

Warning: Release does not exist

Release name: spark does not exist. It may have been deleted outside of
Terraform

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
